app/controllers/projects_controller.rb

	def index
		@projects=Project.all
---
SELECT "projects".* FROM "projects"

	def create
		@project = Project.new(project_params)
		if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)

	def show
		@project=Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@project=Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def update
		@project=Project.find(params[:id])
		if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Women In Techies"], ["updated_at", 2016-12-20 08:04:23 UTC], ["id", 1]]

	def destroy
		@project=Project.find(params[:id])
		@project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 2]]